Dr-RegEx/contest2026_497_nitelabu/board/ESP32-S31 Function-CoreBoard-1 + ESP32-S31 Korvo-1/src/esp32s31_bringup.c
/****************************************************************************
 * boards/risc-v/esp32s31/esp32s31-core-function-board/src/esp32s31_bringup.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/mount.h>
#include <syslog.h>

#include <nuttx/fs/fs.h>

#ifdef CONFIG_ESP32S31_KORVO_RGB565
#  include <nuttx/video/fb.h>
#endif

#ifdef CONFIG_INPUT_BUTTONS_LOWER
#  include <nuttx/input/buttons.h>
#endif

#if defined(CONFIG_ESP_RMT) && defined(CONFIG_WS2812_NON_SPI_DRIVER)
#  include <errno.h>
#  include "espressif/esp_rmt.h"
#  include "espressif/esp_ws2812.h"
#endif

#if defined(CONFIG_ESPRESSIF_I2C0) && defined(CONFIG_I2C_DRIVER)
#  include <errno.h>
#  include <nuttx/i2c/i2c_master.h>
#  include "espressif/esp_i2c.h"
#endif

#if defined(CONFIG_ESPRESSIF_SPI2) && defined(CONFIG_SPI_DRIVER)
#  include <errno.h>
#  include <nuttx/spi/spi_transfer.h>
#  include "espressif/esp_spi.h"
#endif

#if defined(CONFIG_ESP32S31_CAMERA_OV2640) || \
    defined(CONFIG_ESP32S31_CAMERA_OV3660)
int esp32s31_camera_initialize(void);
#endif

#ifdef CONFIG_ESP32S31_SMP_TEST
#  include <assert.h>
#  include <errno.h>
#  include <inttypes.h>
#  include <sched.h>
#  include <stdbool.h>
#  include <stdlib.h>
#  include <sys/wait.h>
#  include <nuttx/arch.h>
#  include <nuttx/clock.h>
#  include <nuttx/kthread.h>
#  include <nuttx/semaphore.h>
#endif

#include "esp32s31_monstat.h"
#include "esp32s31_tlb.h"

#ifdef CONFIG_ESP32S31_USBHOST
#  include "esp32s31_usbhost.h"
#endif

#if defined(CONFIG_ESP32S31_SDMMC) && defined(CONFIG_MMCSD) && \
    defined(CONFIG_MMCSD_SDIO)
#  include "esp32s31_sdmmc.h"
#endif

#ifdef CONFIG_ESP32S31_WIFI_EVENT_TEST
int esp32s31_event_test(void);
#endif

#ifdef CONFIG_ESP32S31_MQUEUE_TEST
int esp32s31_mqueue_test(void);
#endif

#ifdef CONFIG_ESP32S31_FLASH_APPFS
#  include <errno.h>
#  include <fcntl.h>
#  include <inttypes.h>
#  include <stdbool.h>
#  include <stdio.h>
#  include <string.h>
#  include <sys/stat.h>
#  include <unistd.h>
#  include <nuttx/mtd/mtd.h>

#  include "espressif/esp_spiflash.h"
#  include "espressif/esp_spiflash_mtd.h"
#elif defined(CONFIG_BUILD_KERNEL)
#  include <nuttx/drivers/ramdisk.h>
#  include <nuttx/fs/fs.h>
#endif

#include "esp32s31-core-function-board.h"

#ifdef CONFIG_RTC_DRIVER
#  include "espressif/esp_rtc.h"
#endif

#ifdef CONFIG_TIMER
#  include "espressif/esp_timer.h"
#endif

#ifdef CONFIG_ESP32S31_RWDT
#  include "esp32s31_wdt.h"
#endif

#ifdef CONFIG_ESPRESSIF_WIFI
#  include "espressif/esp_wlan.h"
#endif

#ifdef CONFIG_ESP32S31_FLASH_APPFS

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifdef CONFIG_ESP32S31_SMP_TEST
#  define ESP32S31_SMP_TEST_PRIORITY 80

static sem_t g_esp32s31_smp_start;
static sem_t g_esp32s31_smp_ack;
static volatile int g_esp32s31_smp_test_status;

extern volatile uint32_t g_esp32s31_smp_ipi_send[CONFIG_SMP_NCPUS];
extern volatile uint32_t g_esp32s31_smp_ipi_receive[CONFIG_SMP_NCPUS];
extern volatile uint32_t g_esp32s31_smp_timer_count[CONFIG_SMP_NCPUS];
extern volatile uint32_t g_esp32s31_smp_cpu1_stage;
extern volatile uint32_t g_esp32s31_smp_cpu1_cpuint;
extern volatile uint32_t g_esp32s31_smp_cpu1_sstatus;
extern volatile uint32_t g_esp32s31_smp_cpu1_sintthresh;
extern uint32_t esp32s31_smp_cpu1_ipi_state(void);
extern uint32_t esp32s31_smp_cpu1_ipi_route(void);

static int esp32s31_smp_cpu1_worker(int argc, char *argv[])
{
  int semvalue;
  int wait;
  int round;

  for (round = 0; round < CONFIG_ESP32S31_SMP_TEST_ROUNDS; round++)
    {
      if (nxsem_wait_uninterruptible(&g_esp32s31_smp_start) < 0 ||
          sched_getcpu() != 1)
        {
          g_esp32s31_smp_test_status = -EXDEV;
          nxsem_post(&g_esp32s31_smp_ack);
          return EXIT_FAILURE;
        }

      /* Make this a deterministic cross-core wakeup test.  Without this
       * handshake CPU1 can post the acknowledgement before CPU0 has joined
       * the wait queue, in which case no reverse scheduling IPI is needed.
       */

      semvalue = 0;
      for (wait = 0; wait < 20000; wait++)
        {
          nxsem_get_value(&g_esp32s31_smp_ack, &semvalue);
          if (semvalue < 0)
            {
              break;
            }

          up_udelay(10);
        }

      if (semvalue >= 0)
        {
          g_esp32s31_smp_test_status = -ETIMEDOUT;
          nxsem_post(&g_esp32s31_smp_ack);
          return EXIT_FAILURE;
        }

      g_esp32s31_smp_test_status = round + 1;
      nxsem_post(&g_esp32s31_smp_ack);
    }

  return EXIT_SUCCESS;
}

static int esp32s31_smp_scheduler_test(void)
{
  uint32_t ipi0_before = g_esp32s31_smp_ipi_receive[0];
  uint32_t ipi1_before = g_esp32s31_smp_ipi_receive[1];
  uint32_t timer1_before = g_esp32s31_smp_timer_count[1];
  cpu_set_t cpuset;
  cpu_set_t original_cpuset;
  bool parent_pinned = false;
  pid_t pid;
  int round;
  int ret;

  if (sched_getaffinity(0, sizeof(original_cpuset), &original_cpuset) < 0)
    {
      return -errno;
    }

  CPU_ZERO(&cpuset);
  CPU_SET(0, &cpuset);
  if (sched_setaffinity(0, sizeof(cpuset), &cpuset) < 0)
    {
      return -errno;
    }

  parent_pinned = true;
  nxsem_init(&g_esp32s31_smp_start, 0, 0);
  nxsem_init(&g_esp32s31_smp_ack, 0, 0);
  g_esp32s31_smp_test_status = 0;
  syslog(LOG_INFO, "TEST:BEGIN stage=smp-scheduler cpu=%d\n",
         sched_getcpu());

  /* Keep the worker below the board bring-up thread until its affinity is
   * installed.  G.2.0 validates a task pinned before first execution; live
   * cross-core task migration belongs to the later address-environment
   * shootdown stage. */

  pid = kthread_create("s31-cpu1-test", ESP32S31_SMP_TEST_PRIORITY, 2048,
                       esp32s31_smp_cpu1_worker, NULL);
  if (pid < 0)
    {
      ret = (int)pid;
      goto out;
    }

  syslog(LOG_INFO, "SMP scheduler worker created: pid=%d\n", pid);

  CPU_ZERO(&cpuset);
  CPU_SET(1, &cpuset);
  ret = sched_setaffinity(pid, sizeof(cpuset), &cpuset);
  if (ret < 0)
    {
      ret = -errno;
      goto out;
    }

