Dr-RegEx/contest2026_497_nitelabu/board/ESP32-S31 Function-CoreBoard-1 + ESP32-S31 Korvo-1/src/esp32s31_bringup.c
  syslog(LOG_INFO, "SMP scheduler worker pinned: pid=%d cpu=1\n", pid);

  for (round = 0; round < CONFIG_ESP32S31_SMP_TEST_ROUNDS; round++)
    {
      nxsem_post(&g_esp32s31_smp_start);
      ret = nxsem_tickwait_uninterruptible(&g_esp32s31_smp_ack,
                                            SEC2TICK(2));
      if (ret < 0 || g_esp32s31_smp_test_status != round + 1 ||
          sched_getcpu() != 0)
        {
          ret = ret < 0 ? ret : -EIO;
          goto out;
        }
    }

  if (g_esp32s31_smp_ipi_receive[0] <= ipi0_before ||
      g_esp32s31_smp_ipi_receive[1] <= ipi1_before)
    {
      ret = -ETIMEDOUT;
      goto out;
    }

  /* Target1 is a private CPU1 interrupt, not a second owner of the global
   * NuttX clock.  Require at least one fresh interrupt after the test began
   * so a stale boot-time count cannot satisfy the per-core timer proof. */

  for (round = 0; round < 20000 &&
       g_esp32s31_smp_timer_count[1] <= timer1_before; round++)
    {
      up_udelay(10);
    }

  if (g_esp32s31_smp_timer_count[1] <= timer1_before)
    {
      ret = -ETIMEDOUT;
      goto out;
    }

  /* Without CONFIG_SCHED_CHILD_STATUS a finished kernel thread is reaped
   * immediately.  The final acknowledgement already proves that it ran to
   * completion, and a later waitpid() would race with that automatic reap
   * and report ECHILD.
   */

#ifdef CONFIG_SCHED_CHILD_STATUS
  if (waitpid(pid, NULL, 0) != pid)
    {
      ret = -errno;
      goto out;
    }
#endif

  pid = -1;

  syslog(LOG_INFO,
         "TEST:PASS stage=smp-scheduler rounds=%d cpu0-ipi=%" PRIu32
         " cpu1-ipi=%" PRIu32 " timer1=%" PRIu32 "\n",
         CONFIG_ESP32S31_SMP_TEST_ROUNDS,
         g_esp32s31_smp_ipi_receive[0] - ipi0_before,
         g_esp32s31_smp_ipi_receive[1] - ipi1_before,
         g_esp32s31_smp_timer_count[1] - timer1_before);
  ret = OK;

out:
  if (pid > 0 && ret < 0)
    {
      kthread_delete(pid);
    }

  if (ret >= 0)
    {
      nxsem_destroy(&g_esp32s31_smp_ack);
      nxsem_destroy(&g_esp32s31_smp_start);
    }

  if (parent_pinned)
    {
      sched_setaffinity(0, sizeof(original_cpuset), &original_cpuset);
    }

  if (ret < 0)
    {
      syslog(LOG_ERR,
             "TEST:FAIL stage=smp-scheduler ret=%d status=%d cpu1-stage=%"
             PRIu32 " cpuint=%" PRIu32 " ipi-send=%" PRIu32 "/%"
             PRIu32 " ipi-recv=%" PRIu32 "/%" PRIu32
             " pending=%" PRIu32 " route=%08" PRIx32
             " sstatus=%08" PRIx32 " sintthresh=%08" PRIx32 "\n",
             ret, g_esp32s31_smp_test_status, g_esp32s31_smp_cpu1_stage,
             g_esp32s31_smp_cpu1_cpuint,
             g_esp32s31_smp_ipi_send[0], g_esp32s31_smp_ipi_send[1],
             g_esp32s31_smp_ipi_receive[0],
             g_esp32s31_smp_ipi_receive[1],
             esp32s31_smp_cpu1_ipi_state(),
             esp32s31_smp_cpu1_ipi_route(),
             g_esp32s31_smp_cpu1_sstatus,
             g_esp32s31_smp_cpu1_sintthresh);
    }

  return ret;
}
#endif

static bool esp32s31_mtd_is_erased(struct mtd_dev_s *mtd)
{
  uint8_t buffer[64];
  ssize_t nread;
  size_t i;

  nread = MTD_READ(mtd, 0, sizeof(buffer), buffer);
  if (nread != sizeof(buffer))
    {
      return false;
    }

  for (i = 0; i < sizeof(buffer); i++)
    {
      if (buffer[i] != 0xff)
        {
          return false;
        }
    }

  return true;
}

static int esp32s31_mtd_boundary_test(struct mtd_dev_s *mtd,
                                      size_t partition_size)
{
  struct mtd_geometry_s geometry;
  uint8_t buffer = 0xff;
  int ret;

  ret = MTD_IOCTL(mtd, MTDIOC_GEOMETRY,
                  (unsigned long)((uintptr_t)&geometry));
  if (ret < 0)
    {
      return ret;
    }

  if (MTD_READ(mtd, partition_size, 1, &buffer) >= 0 ||
      MTD_WRITE(mtd, partition_size, 1, &buffer) >= 0 ||
      MTD_ERASE(mtd, geometry.neraseblocks, 1) >= 0)
    {
      return -EIO;
    }

  syslog(LOG_INFO, "AppFS MTD boundary checks: PASS\n");
  return OK;
}

#ifdef CONFIG_ESP32S31_FLASH_APPFS_SEED_INSTALL
static int esp32s31_copy_file(const char *source, const char *target,
                              mode_t mode)
{
  struct file src;
  struct file dst;
  uint8_t buffer[512];
  ssize_t nread;
  ssize_t nwritten;
  size_t offset;
  int ret;

  ret = file_open(&src, source, O_RDONLY);
  if (ret < 0)
    {
      return ret;
    }

  ret = file_open(&dst, target, O_WRONLY | O_CREAT | O_TRUNC, mode);
  if (ret < 0)
    {
      file_close(&src);
      return ret;
    }

  for (;;)
    {
      nread = file_read(&src, buffer, sizeof(buffer));
      if (nread <= 0)
        {
          ret = nread < 0 ? (int)nread : OK;
          break;
        }

      offset = 0;
      while (offset < nread)
        {
          nwritten = file_write(&dst, buffer + offset, nread - offset);
          if (nwritten <= 0)
            {
              ret = nwritten < 0 ? (int)nwritten : -EIO;
              goto out;
            }

          offset += nwritten;
        }
    }

  if (ret == OK)
    {
      ret = file_fsync(&dst);
    }

out:
  file_close(&dst);
  file_close(&src);
  return ret;
}

static int esp32s31_create_seed_marker(const char *path)
{
  static const char contents[] = "S31-E0\n";
  struct file marker;
  ssize_t nwritten;
  int ret;

  ret = file_open(&marker, path, O_WRONLY | O_CREAT | O_TRUNC, 0444);
  if (ret < 0)
    {
      return ret;
    }

  nwritten = file_write(&marker, contents, sizeof(contents) - 1);
  if (nwritten != sizeof(contents) - 1)
    {
      ret = nwritten < 0 ? (int)nwritten : -EIO;
    }
  else
    {
      ret = file_fsync(&marker);
    }

  file_close(&marker);
  return ret;
}

static int esp32s31_install_seed_app(void)
{
  static const char source[] = ESP32S31_APPFS_SEED_DIR "/sv32test";
  static const char source_hash[] =
    ESP32S31_APPFS_SEED_DIR "/sv32test.sha256";
  static const char target[] = ESP32S31_APPS_DIR "/sv32test";
  static const char target_hash[] = ESP32S31_APPS_DIR "/sv32test.sha256";
  static const char temp[] = ESP32S31_APPS_DIR "/.sv32test.new";
  static const char temp_hash[] =
    ESP32S31_APPS_DIR "/.sv32test.sha256.new";
  static const char marker[] = ESP32S31_APPS_DIR "/.seeded";
  struct stat st;
  int ret;

  /* The marker makes a later user deletion persistent.  For filesystems
   * seeded by an older image, adopt the existing complete pair first.
   */

  if (nx_stat(marker, &st, 0) == OK)
    {
      return OK;
    }

