Dr-RegEx/contest2026_497_nitelabu/board/ESP32-S31 Function-CoreBoard-1 + ESP32-S31 Korvo-1/src/esp32s31_bringup.c
  if (nx_stat(target, &st, 0) == OK &&
      nx_stat(target_hash, &st, 0) == OK)
    {
      ret = esp32s31_create_seed_marker(marker);
      if (ret < 0)
        {
          syslog(LOG_ERR, "ERROR: AppFS seed marker failed: %d\n", ret);
        }

      return ret;
    }

  nx_unlink(temp);
  nx_unlink(temp_hash);

  ret = esp32s31_copy_file(source, temp, 0555);
  if (ret < 0)
    {
      goto errout;
    }

  ret = esp32s31_copy_file(source_hash, temp_hash, 0444);
  if (ret < 0)
    {
      goto errout;
    }

  if (rename(temp, target) < 0)
    {
      ret = -errno;
      goto errout;
    }

  if (rename(temp_hash, target_hash) < 0)
    {
      ret = -errno;
      goto errout;
    }

  ret = esp32s31_create_seed_marker(marker);
  if (ret < 0)
    {
      goto errout;
    }

  syslog(LOG_INFO, "AppFS installed seed application: %s\n", target);
  return OK;

errout:
  nx_unlink(temp);
  nx_unlink(temp_hash);
  syslog(LOG_ERR, "ERROR: AppFS seed install failed: %d\n", ret);
  return ret;
}
#endif
#endif

#ifdef CONFIG_ESPRESSIF_WIFI
static int start_wifi_station(void)
{
  return esp_wlan_sta_initialize();
}
#endif

int esp_bringup(void)
{
  int ret = OK;

#ifdef CONFIG_ESP32S31_KORVO_RGB565
  ret = fb_register(0, 0);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Korvo RGB565 framebuffer failed: %d\n", ret);
      return ret;
    }

  syslog(LOG_INFO, "OPENVELA_FB_READY /dev/fb0 RGB565 800x480\n");
#endif

#ifdef CONFIG_ESP32S31_USBHOST
  ret = esp32s31_usbhost_initialize();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: USB host register init failed: %d\n", ret);
      return ret;
    }

#ifdef CONFIG_ESP32S31_USBHOST_HCD_SKELETON
  ret = esp32s31_usbhost_hcd_skeleton_contract();
  if (ret == 0)
    {
      ret = esp32s31_usbhost_hcd_start();
    }
  if (ret < 0)
    {
      return ret;
    }
#endif
  syslog(LOG_WARNING,
         "USB host PIO candidate started; hardware validation pending\n");
#endif

#if defined(CONFIG_ESP32S31_SDMMC) && defined(CONFIG_MMCSD) && \
    defined(CONFIG_MMCSD_SDIO)
  ret = esp32s31_sdmmc_register(0);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "SDMMC bridge candidate not registered: %d\n", ret);
    }
#endif

#ifdef CONFIG_ESP32S31_XTS_MEDIA_VOLUME
  /* Reserve the contiguous WAV buffer before other board services. */

  ret = esp32s31_xts_media_volume_initialize();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: xTS WAV volume unavailable: %d\n", ret);
      return ret;
    }
#endif


#if defined(CONFIG_ESP_RMT) && defined(CONFIG_WS2812_NON_SPI_DRIVER)
  struct rmt_dev_s *rmt = esp_rmt_tx_init(0, 60);

  if (rmt == NULL || esp_ws2812_setup("/dev/leds0", rmt, 1, false) == NULL)
    {
      syslog(LOG_ERR, "ERROR: Board RGB LED initialization failed\n");
      return -ENODEV;
    }
#endif

#if defined(CONFIG_ESPRESSIF_SPI2) && defined(CONFIG_SPI_DRIVER)
  struct spi_dev_s *spi = esp_spibus_initialize(2);

  if (spi == NULL)
    {
      return -ENODEV;
    }

  ret = spi_register(spi, 2);
  if (ret < 0)
    {
      esp_spibus_uninitialize(spi);
      return ret;
    }
#endif

#if defined(CONFIG_ESPRESSIF_I2C0) && defined(CONFIG_I2C_DRIVER)
  struct i2c_master_s *i2c = esp_i2cbus_initialize(0);

  if (i2c == NULL)
    {
      syslog(LOG_ERR, "ERROR: I2C0 initialization failed\n");
      return -ENODEV;
    }

  ret = i2c_register(i2c, 0);
  if (ret < 0)
    {
      esp_i2cbus_uninitialize(i2c);
      syslog(LOG_ERR, "ERROR: I2C0 registration failed: %d\n", ret);
      return ret;
    }
#endif

#ifdef CONFIG_ESP32S31_AUDIO
  ret = esp32s31_audio_initialize();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Board audio initialization failed: %d\n", ret);
      return ret;
    }
#endif

#if defined(CONFIG_ESP32S31_CAMERA_OV2640) || \
    defined(CONFIG_ESP32S31_CAMERA_OV3660)
  ret = esp32s31_camera_initialize();
  if (ret < 0)
    {
      syslog(LOG_WARNING,
             "Camera unavailable: %d; camera capture not ready\n", ret);
    }
#endif

#ifdef CONFIG_ESP32S31_XTS_ADC
  ret = esp32s31_adc_setup();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: ADC registration failed: %d\n", ret);
      return ret;
    }
#endif

#ifdef CONFIG_ESP32S31_XTS_BMI160
  ret = esp32s31_bmi160_initialize();
  if (ret < 0)
    {
      syslog(LOG_WARNING, "BMI160 unavailable: %d; sensor xTS not ready\n",
             ret);
    }
#endif

#ifdef CONFIG_ESP32S31_XTS_BMI160_UORB
  ret = esp32s31_bmi160_uorb_initialize();
  if (ret < 0)
    {
      syslog(LOG_WARNING, "BMI160 uORB unavailable: %d; sensor xTS not ready\n",
             ret);
    }
#endif

#ifdef CONFIG_ESP32S31_XTS_PWM
  ret = esp32s31_pwm_setup();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: PWM registration failed: %d\n", ret);
      return ret;
    }
#endif

#ifdef CONFIG_ESP32S31_XTS_GPIO
  ret = esp32s31_xts_gpio_initialize();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: GPIO xTS registration failed: %d\n", ret);
      return ret;
    }
#endif

#ifdef CONFIG_INPUT_BUTTONS_LOWER
  ret = btn_lower_initialize("/dev/buttons");
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: button initialization failed: %d\n", ret);
      return ret;
    }
#endif

  ret = esp32s31_tlb_register_stats_device();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: /dev/tlbshoot register failed: %d\n", ret);
      return ret;
    }

  ret = esp32s31_monstat_register_device();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: /dev/s31stat register failed: %d\n", ret);
      return ret;
    }

#ifdef CONFIG_ESP32S31_SMP_TEST
  ret = esp32s31_smp_scheduler_test();
  if (ret < 0)
    {
      return ret;
    }
#endif

#ifdef CONFIG_ESP32S31_MQUEUE_TEST
  ret = esp32s31_mqueue_test();
  if (ret < 0)
    {
      return ret;
    }
#endif

#ifdef CONFIG_ESP32S31_WIFI_EVENT_TEST
  ret = esp32s31_event_test();
  if (ret < 0)
    {
      return ret;
    }
#endif

#ifdef CONFIG_FS_PROCFS
  ret = nx_mount(NULL, "/proc", "procfs", 0, NULL);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Failed to mount procfs at /proc: %d\n", ret);
    }
#endif

