Dr-RegEx/contest2026_497_nitelabu/board/ESP32-S31 Function-CoreBoard-1 + ESP32-S31 Korvo-1/src/esp32s31_bringup.c
#ifdef CONFIG_FS_TMPFS
  /* Resolver state must be shared by separately linked U-mode processes.
   * Keep it in a volatile filesystem rather than in process-local libc data
   * or persistent application flash.
   */

  ret = nx_mount(NULL, CONFIG_LIBC_TMPDIR, "tmpfs", 0, NULL);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: tmpfs mount at %s failed: %d\n",
             CONFIG_LIBC_TMPDIR, ret);
      return ret;
    }
#endif

#ifdef CONFIG_RTC_DRIVER
  /* Wi-Fi and PHY callbacks use the ESP high-resolution timer adapter. */

  ret = esp_rtc_driverinit();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: RTC/high-resolution timer init failed: %d\n",
             ret);
      return ret;
    }
#endif

#ifdef CONFIG_ESP32S31_BLE
  ret = esp32s31_ble_initialize();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: BLE HCI registration failed: %d\n", ret);
      return ret;
    }
#endif

#ifdef CONFIG_TIMER
  ret = esp_timer_initialize(0);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Timer 0 init failed: %d\n", ret);
      return ret;
    }
#endif

#ifdef CONFIG_ESP32S31_XTS_FLASH
  ret = esp32s31_xts_flash_initialize();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: xTS Flash registration failed: %d\n", ret);
      return ret;
    }
#endif

#ifdef CONFIG_ESP32S31_RWDT
  ret = esp32s31_wdt_initialize("/dev/watchdog0");
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: RTC watchdog registration failed: %d\n", ret);
      return ret;
    }
#endif

#ifdef CONFIG_ESP32S31_FLASH_APPFS
  uint8_t header[8];
  struct mtd_dev_s *seed_mtd;
  struct mtd_dev_s *apps_mtd;
  size_t region_size = CONFIG_ESPRESSIF_STORAGE_MTD_SIZE;
  size_t seed_size = CONFIG_ESP32S31_FLASH_APPFS_SEED_SIZE;
  size_t apps_offset;
  size_t apps_size;
  ssize_t nread;

  ret = esp_spiflash_init();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: SPI flash init failed: %d\n", ret);
      return ret;
    }

  if (seed_size == 0 || seed_size >= region_size)
    {
      syslog(LOG_ERR, "ERROR: invalid AppFS seed size: %zu/%zu\n",
             seed_size, region_size);
      return -EINVAL;
    }

  apps_offset = CONFIG_ESPRESSIF_STORAGE_MTD_OFFSET + seed_size;
  apps_size = region_size - seed_size;

  seed_mtd = esp_spiflash_alloc_mtdpart(
    CONFIG_ESPRESSIF_STORAGE_MTD_OFFSET, seed_size);
  if (seed_mtd == NULL)
    {
      syslog(LOG_ERR, "ERROR: failed to create AppFS seed MTD\n");
      return -EINVAL;
    }

  nread = MTD_READ(seed_mtd, 0, sizeof(header), header);
  if (nread != sizeof(header))
    {
      syslog(LOG_ERR, "ERROR: AppFS header read failed: %zd\n", nread);
      return nread < 0 ? (int)nread : -EIO;
    }

  syslog(LOG_INFO,
         "AppFS header: %02" PRIx8 "%02" PRIx8 "%02" PRIx8 "%02" PRIx8
         "%02" PRIx8 "%02" PRIx8 "%02" PRIx8 "%02" PRIx8 "\n",
         header[0], header[1], header[2], header[3],
         header[4], header[5], header[6], header[7]);

  ret = ftl_initialize_by_path(ESP32S31_APPFS_BLOCKDEV, seed_mtd, O_RDONLY);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: AppFS FTL registration failed: %d\n", ret);
      return ret;
    }

  ret = nx_mount(ESP32S31_APPFS_BLOCKDEV, ESP32S31_APPFS_SEED_DIR,
                 "romfs", MS_RDONLY, NULL);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: AppFS seed mount failed: %d\n", ret);
      return ret;
    }

  apps_mtd = esp_spiflash_alloc_mtdpart(apps_offset, apps_size);
  if (apps_mtd == NULL)
    {
      syslog(LOG_ERR, "ERROR: failed to create writable AppFS MTD\n");
      return -EINVAL;
    }

  ret = esp32s31_mtd_boundary_test(apps_mtd, apps_size);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: AppFS MTD boundary checks failed: %d\n", ret);
      return ret;
    }

  ret = register_mtddriver(ESP32S31_APPS_MTDDEV, apps_mtd, 0755, NULL);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: writable AppFS MTD registration failed: %d\n",
             ret);
      return ret;
    }

  ret = nx_mount(ESP32S31_APPS_MTDDEV, ESP32S31_APPS_DIR,
                 "littlefs", 0, NULL);
  if (ret < 0 && esp32s31_mtd_is_erased(apps_mtd))
    {
      syslog(LOG_INFO, "AppFS LittleFS is blank; formatting once\n");
      ret = nx_mount(ESP32S31_APPS_MTDDEV, ESP32S31_APPS_DIR,
                     "littlefs", 0, "forceformat");
    }

  if (ret < 0)
    {
      syslog(LOG_ERR,
             "ERROR: writable AppFS mount failed without destructive "
             "reformat: %d\n", ret);
      return ret;
    }

  syslog(LOG_INFO, "AppFS writable LittleFS: offset=%#zx size=%#zx\n",
         apps_offset, apps_size);

#ifdef CONFIG_ESP32S31_FLASH_APPFS_SEED_INSTALL
  syslog(LOG_INFO, "AppFS checking seed application\n");
  ret = esp32s31_install_seed_app();
  if (ret < 0)
    {
      return ret;
    }
#endif

#ifdef CONFIG_ESPRESSIF_WIFI
  syslog(LOG_INFO, "Initializing Wi-Fi station\n");
  ret = start_wifi_station();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Wi-Fi station init failed: %d\n", ret);
    }
  else
    {
      syslog(LOG_INFO, "E1 Wi-Fi station netdev ready\n");
    }
#endif

  return ret;
#elif defined(CONFIG_BUILD_KERNEL)
  extern const unsigned char romfs_img[];
  extern const unsigned int romfs_img_len;

#  define SECTORSIZE  512
#  define NSECTORS(n) (((n) + SECTORSIZE - 1) / SECTORSIZE)

  if (NSECTORS(romfs_img_len) > 1)
    {
      ret = romdisk_register(0, romfs_img, NSECTORS(romfs_img_len),
                             SECTORSIZE);
      if (ret < 0)
        {
          return ret;
        }
    }
#endif

#ifdef CONFIG_ESPRESSIF_WIFI
  return start_wifi_station();
#endif

  return 0;
}
